share/tutorials/incompressible/simple/motor_bike/constant/turbulenceProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      turbulenceProperties;
}

simulationType RAS;
RAS
{
  RASModel            kOmegaSST;
  turbulence          on;
  printCoeffs         on;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
