share/tutorials/incompressible/simple/motor_bike/0.org/include/fixedInlet
inlet
{
    type  fixedValue;
    value $internalField;
}
