share/tutorials/incompressible/simple/motor_bike/0.org/include/initialConditions
flowVelocity         (20 0 0);
pressure             0;
turbulentKE          0.24;
turbulentOmega       1.78;

#inputMode           merge

