share/tutorials/incompressible/simple/motor_bike/0.org/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      k;
}

#include        "include/initialConditions"
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform $turbulentKE;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  //- Define inlet conditions
  #include "include/fixedInlet"
  outlet
  {
    type            inletOutlet;
    inletValue      $internalField;
    value           $internalField;
  }
  lowerWall
  {
    type            kqRWallFunction;
    value           $internalField;
  }
  motorBikeGroup
  {
    type            kqRWallFunction;
    value           $internalField;
  }
  #include "include/frontBackUpperPatches"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
