share/tutorials/incompressible/simple/motor_bike/system/decomposeParDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      decomposeParDict;
}

numberOfSubdomains 6;
method          hierarchical;
// method          ptscotch;
simpleCoeffs
{
  n               (4 1 1);
  delta           0.001;
}
hierarchicalCoeffs
{
  n               (3 2 1);
  delta           0.001;
  order           xyz;
}
manualCoeffs
{
  dataFile        "cellDecomposition";
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
