share/tutorials/incompressible/simple/motor_bike/system/meshQualityDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      meshQualityDict;
}

// Include defaults parameters from master dictionary
#includeEtc "case_dicts/meshQualityDict"
//- minFaceWeight (0 -> 0.5)
minFaceWeight 0.02;

// vim: set ft=foam et sw=2 ts=2 sts=2:
