share/tutorials/incompressible/simple/motor_bike/system/readFields
// Make sure all fields for functionObjects are loaded. Prevents any
// problems running with execFlowFunctionObjects.
readFields
{
    // Where to load it from (if not already in solver)
    functionObjectLibs ("libmousse_field_function_objects.so");

    type            readFields;
    fields          (p U k);
}

