share/tutorials/incompressible/simple/motor_bike/system/surfaceFeatureExtractDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      surfaceFeatureExtractDict;
}

motorBike.obj
{
  // How to obtain raw features (extractFromFile || extractFromSurface)
  extractionMethod    extractFromSurface;
  extractFromSurfaceCoeffs
  {
    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle   150;
  }
  subsetFeatures
  {
    // Keep nonManifold edges (edges with >2 connected faces)
    nonManifoldEdges       no;
    // Keep open edges (edges with 1 connected face)
    openEdges       yes;
  }
  // Write options
    // Write features to obj format for postprocessing
    writeObj                yes;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
